// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
int n = Convert.ToInt32(Console.ReadLine());

Console.WriteLine((n/10)%10);
